blog/org-mode.html
<!DOCTYPE html>
<html>
<head>
<title>Org mode 周辺のあれこれ</title>
<!-- 2018-01-16 Tue 21:10 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="/css/prelude.css" />
<link rel="stylesheet" type="text/css" href="/css/highlight.css" />
</head>
<body>
<div id="content">
<h1 class="title">Org mode 周辺のあれこれ</h1>
<div class="location">
<p>
https://<a href="/">bydriv.github.io</a>/<a href="/blog">blog</a>/<strong>org-mode.html</strong>
</p>

</div>

<div class="created_at">
<p>
created at <time datetime="2018-01-15">2018-01-15</time>
</p>

</div>

<div class="updated_at">
<p>
updated at <time datetime="2018-01-16">2018-01-16</time>
</p>

</div>

<p>
Emacs には標準で org mode という便利なものがついてくる．
このブログも org mode で書いている．
それで最近は org mode ばかり使っているのだけど，
使い方をすぐ忘れそうなのでここに記録しておく．
ここに書いたほかにもまあいろいろあるけど時間がかかる．
気が向いたら追記してゆくかもしれない．
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Org Babel</h2>
<div class="outline-text-2" id="text-1">
<p>
<code>.org</code> ファイルに記述したソースコードを実行し，
その出力を <code>.html</code> や <code>.tex</code> に含めてくれる便利な機能がある．
たとえば， <code>example.html</code> をその場に展開したいとしよう．
そのためには， <code>.org</code> ファイルに次のように書けばよい．
</p>

<pre>
#+BEGIN_SRC sh :exports results :results html
cat example.html
#+END_SRC
</pre>

<p>
ただし， <code>$HOME/.emacs.d/init.el</code> などに次のような設定が書かれていることが前提である．
</p>

<div class="org-src-container">

<pre class="src src-elisp">(org-babel-do-load-languages 'org-babel-load-languages '((sh . t)))
</pre>
</div>

<p>
わたしはコマンドを呼びだすためだけに使っているが，
ほかにもいろいろな言語を実行できるようである．
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Emacs Batch Mode</h2>
<div class="outline-text-2" id="text-2">
<p>
Org mode で <code>.html</code> を出力するのにいちいち Emacs を起動するのは面倒である．
なのでわたしは， Emacs を batch mode で呼びだして <code>.html</code> を出力している．
</p>

<div class="org-src-container">

<pre class="src src-sh">yes yes | emacs -batch -u $(whoami) example.org -f org-html-export-to-html
</pre>
</div>

<p>
Org Babel がプログラムを実行するときにいちいち確認を求めるので，
<code>yes</code> コマンドですべて実行させている
(<code>yes</code> コマンドを実用できるときもちがよい)．
<code>-batch</code> オプションをつけると <code>$HOME/.emacs.d/init.el</code> が読まれないので，
<code>-u $(whoami)</code> で読むようにしている (これは用途によっては使わないほうがよいかもしれない)．
<code>-f org-html-export-to-html</code> で Emacs の関数を呼びだし，
<code>.html</code> へ変換している．
</p>

<p>
じつはコマンドラインから <code>.org</code> を <code>.html</code> へ変換するために
Pandoc を使おうと思ったこともあるのだが，
いろいろ機能が足りないようなので諦めた．
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Plain HTML</h2>
<div class="outline-text-2" id="text-3">
<p>
Org mode は標準でいろいろ CSS などを設定してくれるのだが，
ブログ用途などでは含めないでほしいこともある．
これはけっこうたいへんである．
まず， <code>$HOME/.emacs.d/init.el</code> に次のように書く．
</p>

<div class="org-src-container">

<pre class="src src-elisp">(setq org-html-preamble nil)
(setq org-html-postamble nil)
</pre>
</div>

<p>
それから， <code>.org</code> ファイルにもいろいろ書く．
</p>

<pre>
#+OPTIONS: html-style:nil
#+OPTIONS: html-scripts:nil
#+OPTIONS: author:nil
#+OPTIONS: date:nil
#+OPTIONS: toc:nil
#+OPTIONS: num:nil
#+HTML_DOCTYPE: html5
</pre>

<p>
これらの設定を共通化したいなら， <code>#+SETUPFILE:</code> という命令が使える．
<code>setup.org</code> などに上記のように書いておいて，
それぞれの <code>.org</code> ファイルから次のように読む．
</p>

<pre>
#+SETUPFILE: setup.org
</pre>
</div>
</div>
</div>
</body>
</html>
